hankso/esp32/espbase/main/drivers.c
/* 
 * File: drivers.c
 * Authors: Hank <hankso1106@gmail.com>
 * Create: 2020-05-06 19:54:28
 */

#include "sdkconfig.h"
#include "drivers.h"

#include "esp_log.h"
#include "esp_attr.h"
#include "esp_vfs_dev.h"
#include "esp_adc_cal.h"
#include "esp_task_wdt.h"
#include "esp_intr_alloc.h"
#include "soc/soc.h"
#include "sys/param.h"
#include "driver/adc.h"
#include "driver/i2c.h"
#include "driver/ledc.h"
#include "driver/gpio.h"
#include "driver/uart.h"
#include "driver/spi_common.h"
#include "driver/spi_master.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#if defined(CONFIG_I2C_SCREEN) && __has_include("u8g2_esp32_hal.h")
#   include "u8g2.h"
#   include "u8g2_esp32_hal.h"
#   define WITH_U8G2
#endif
#if defined(CONFIG_VLX_SENSOR) && __has_include("vl53l0x.h")
#    include "vl53l0x.h"
#    define WITH_VLX
#endif
#include "iot_knob.h"
#include "iot_button.h"

static const char *TAG = "Driver";

// LED Controller and Indicator

#ifdef CONFIG_LED_INDICATOR

#   include "led_indicator.h"
static led_indicator_handle_t led_handle;

static void led_initialize() {
#   if defined(CONFIG_LED_MODE_GPIO)
    led_indicator_gpio_config_t gpio_conf = {
        .is_active_level_high = 1,
        .gpio_num = PIN_LED
    };
    led_indicator_config_t led_conf = {
        .mode = LED_GPIO_MODE,
        .led_indicator_gpio_config = &gpio_conf,
    };
#   elif defined(CONFIG_LED_MODE_LEDC)
    led_indicator_ledc_config_t ledc_conf = {
        .is_active_level_high = 1,
        .timer_inited = false,
        .timer_num = LEDC_TIMER_0,
        .gpio_num = PIN_LED,
        .channel = LEDC_CHANNEL_0,
    };
    led_indicator_config_t led_conf = {
        .mode = LED_LEDC_MODE,
        .led_indicator_ledc_config = &ledc_conf,
    };
#   elif defined(CONFIG_LED_MODE_RMT)
    led_indicator_strips_config_t rmt_conf = {
        .led_strip_cfg = {
            .strip_gpio_num = PIN_LED,
            .max_leds = CONFIG_LED_NUM,
            .led_pixel_format = LED_PIXEL_FORMAT_GRB,
            .led_model = LED_MODEL_WS2812,
            .flags.invert_out = false,
        },
        .led_strip_driver = LED_STRIP_RMT,
        .led_strip_rmt_cfg = {
#       if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
            .rmt_channel = 0,
#       else
            .clk_src = RMT_CLK_SRC_DEFAULT,
            .resolution_hz = 10 * 1000 * 1000,  // 10MHz
            .flags.with_dma = false,
#       endif
        },
    };
    led_indicator_config_t led_conf = {
        .mode = LED_STRIPS_MODE,
        .led_indicator_strips_config = &rmt_conf,
    };
#   else // CONFIG_LED_MODE_XXX
    ESP_LOGI(TAG, "LED: disabled by CONFIG_LED_MODE_XXX");
    return;
#   endif // CONFIG_LED_MODE_XXX
    // #include "led_indicator_blink_default.h"
    // led_conf.blinnk_lists = default_led_indicator_blink_lists;
    // led_conf.blinnk_lists_num = DEFAULT_BLINK_LIST_NUM;
    if (!( led_handle = led_indicator_create(&led_conf) )) {
        ESP_LOGW(TAG, "LED: initialize indicator failed");
#ifdef CONFIG_LED_MODE_GPIO
    } else {
        gpio_set_direction(PIN_LED, GPIO_MODE_INPUT_OUTPUT); // gpio_get_level
#endif
    }
}

#else // CONFIG_LED_INDICATOR

#   include "led_strip.h"
typedef struct { uint8_t p, r, g, b; } led_color_t;
typedef struct {
    led_color_t *color;
    led_strip_handle_t strip;
    ledc_mode_t mode;
    ledc_timer_t timer;
    ledc_channel_t channel;
    float duty_scale;
} led_handle_t;

static led_handle_t * led_handle;

static void led_initialize() {
    static led_handle_t local = {
        .mode = LEDC_LOW_SPEED_MODE,
        .timer = LEDC_TIMER_0,
        .channel = LEDC_CHANNEL_0,
    };
#   if defined(CONFIG_LED_MODE_GPIO)
    gpio_reset_pin(PIN_LED);
    gpio_set_direction(PIN_LED, GPIO_MODE_INPUT_OUTPUT);
#   elif defined(CONFIG_LED_MODE_LEDC)
    ledc_timer_config_t timer_conf = {
        .speed_mode         = local.mode,
        .timer_num          = local.timer,
        .duty_resolution    = LEDC_TIMER_13_BIT,
        .freq_hz            = 5000,
        .clk_cfg            = LEDC_AUTO_CLK
    };
    ledc_channel_config_t ch_conf = {
        .gpio_num           = PIN_LED,
        .speed_mode         = local.mode,
        .channel            = local.channel,
        .timer_sel          = local.timer,
        .duty               = 0,
    };
    if (ledc_timer_config(&timer_conf) || ledc_channel_config(&ch_conf)) {
        ESP_LOGE(TAG, "LED: initialize ledc failed");
        return;
    }
    // mapping brightness 0-255 to duty by 13bit resolution
    local.duty_scale = ((1 << 13) - 1) / 255;
#   elif defined(CONFIG_LED_MODE_RMT)
    if (!( local.color = calloc(CONFIG_LED_NUM, sizeof(led_color_t)) )) {
        ESP_LOGE(TAG, "LED: initialize led_color failed");
        return;
    }
    led_strip_config_t strip_conf = {
        .strip_gpio_num = PIN_LED,
        .max_leds = CONFIG_LED_NUM,
        .led_pixel_format = LED_PIXEL_FORMAT_GRB,
        .led_model = LED_MODEL_WS2812,
        .flags.invert_out = false,
    };
    led_strip_rmt_config_t rmt_conf = { .rmt_channel = 0 };
    if (led_strip_new_rmt_device(&strip_conf, &rmt_conf, &local.strip)) {
        ESP_LOGE(TAG, "LED: initialize led_strip failed");
        free(local.color); local.color = NULL;
        return;
    }
    led_strip_clear(local.strip);
#   else // CONFIG_LED_MODE_XXX
    ESP_LOGI(TAG, "LED: disabled by CONFIG_LED_MODE_XXX");
    return;
#   endif // CONFIG_LED_MODE_XXX
    led_handle = &local;
}

#endif // CONFIG_LED_INDICATOR

#if !defined(CONFIG_LED_INDICATOR) && defined(CONFIG_LED_MODE_RMT)
static esp_err_t led_flush(int index, bool refresh) {
    uint8_t
        p = led_handle->color[index].p,
        r = led_handle->color[index].r * p / 255,
        g = led_handle->color[index].g * p / 255,
        b = led_handle->color[index].b * p / 255;
    esp_err_t err = led_strip_set_pixel(led_handle->strip, index, r, g, b);
    if (!err && refresh) err = led_strip_refresh(led_handle->strip);
    return err;
}
#endif

esp_err_t led_set_light(int index, uint8_t brightness) {
    if (!led_handle) return ESP_ERR_INVALID_STATE;
    if (index >= CONFIG_LED_NUM) return ESP_ERR_INVALID_ARG;
#if defined(CONFIG_LED_INDICATOR)
#   if defined(CONFIG_LED_MODE_LEDC) || defined(CONFIG_LED_MODE_RMT)
    return led_indicator_set_brightness(
        led_handle, INSERT_INDEX(index < 0 ? MAX_INDEX : index, brightness));
#   else
    return led_indicator_set_on_off(led_handle, !!brightness);
#   endif
#elif defined(CONFIG_LED_MODE_GPIO)
    return gpio_set_level(PIN_LED, !!brightness);
#elif defined(CONFIG_LED_MODE_LEDC)
    uint32_t duty = brightness * led_handle->duty_scale;
    esp_err_t err = ledc_set_duty(led_handle->mode, led_handle->channel, duty);
    if (!err) err = ledc_update_duty(led_handle->mode, led_handle->channel);
    return err;
#elif defined(CONFIG_LED_MODE_RMT)
    esp_err_t err = ESP_OK;
    LOOPND(i, CONFIG_LED_NUM) {
        if (index >= 0 && index != i) continue;
        led_handle->color[i].p = brightness;
        if (( err = led_flush(i, index == i || !i) )) break;
    }
    return err;
#endif // CONFIG_LED_MODE_XXX
    return ESP_ERR_INVALID_STATE;
}

uint8_t led_get_light(int index) {
    if (!led_handle || index >= CONFIG_LED_NUM) return 0;
#if defined(CONFIG_LED_INDICATOR)
    return led_indicator_get_brightness(led_handle);
#elif defined(CONFIG_LED_MODE_GPIO)
    return gpio_get_level(PIN_LED) ? 0xFF : 0;
#elif defined(CONFIG_LED_MODE_LEDC)
    uint32_t duty = ledc_get_duty(led_handle->mode, led_handle->channel);
    return (uint8_t)(duty / led_handle->duty_scale);
#elif defined(CONFIG_LED_MODE_RMT)
    return led_handle->color[index < 0 ? 0 : index].p;
#endif // CONFIG_LED_MODE_XXX
    return 0;
}

esp_err_t led_set_color(int index, uint32_t color) {
    if (!led_handle) return ESP_ERR_INVALID_STATE;
    if (index >= CONFIG_LED_NUM) return ESP_ERR_INVALID_ARG;
    uint8_t r = (color >> 16) & 0xFF, g = (color >> 8) & 0xFF, b = color & 0xFF;
#if defined(CONFIG_LED_INDICATOR)
#   if defined(CONFIG_LED_MODE_RMT)
    return led_indicator_set_rgb(
        led_handle, SET_IRGB(index < 0 ? MAX_INDEX : index, r, g, b));
#   endif
#elif defined(CONFIG_LED_MODE_GPIO)
    return led_set_light(index, color);
#elif defined(CONFIG_LED_MODE_LEDC)
    return led_set_light(index, (r + g + b) / 3);
#elif defined(CONFIG_LED_MODE_RMT)
    esp_err_t err = ESP_OK;
    LOOPND(i, CONFIG_LED_NUM) {
        if (index >= 0 && index != i) continue;
        led_handle->color[i].r = r;
        led_handle->color[i].g = g;
        led_handle->color[i].b = b;
        if (( err = led_flush(i, index == i || !i) )) break;
    }
    return err;
#endif // CONFIG_LED_MODE_XXX
    NOTUSED(r); NOTUSED(g); NOTUSED(b);
    return ESP_ERR_INVALID_STATE;
}

uint32_t led_get_color(int index) {
    if (!led_handle || index >= CONFIG_LED_NUM) return 0;
#if defined(CONFIG_LED_INDICATOR)
    return led_indicator_get_rgb(led_handle);
#elif defined(CONFIG_LED_MODE_GPIO)
    return led_get_light(index) ? 0xFFFFFF : 0;
#elif defined(CONFIG_LED_MODE_LEDC)
    return led_get_light(index) * 0xFFFFFF / 0xFF;
#elif defined(CONFIG_LED_MODE_RMT)
    led_color_t *cptr = led_handle->color + (index < 0 ? 0 : index);
    return (cptr->r << 16) | (cptr->g << 8) | cptr->b;
#endif // CONFIG_LED_MODE_XXX
    return 0;
}

