hankso/esp32/espbase/main/drivers.c
esp_err_t led_set_blink(int blink_type) {
    static int last = -1;
    if (!led_handle) return ESP_ERR_INVALID_STATE;
#ifdef CONFIG_LED_INDICATOR
    esp_err_t err = ESP_OK;
    if (blink_type == last)
        return err;
    if (blink_type >= 0)
        err = led_indicator_start(led_handle, blink_type);
    if (!err) {
        if (last >= 0)
            led_indicator_stop(led_handle, last);
        last = blink_type;
    }
    return err;
#endif
    return ESP_ERR_INVALID_STATE;
}

// ADC analog in

#ifdef CONFIG_ADC_INPUT
static esp_adc_cal_characteristics_t adc_chars;
static const adc_unit_t adc_unit = ADC_UNIT_1;              // ADC 1
static const adc_atten_t adc_atten = ADC_ATTEN_DB_11;       // 0.15-2.45V
static const adc_bits_width_t adc_width = ADC_WIDTH_BIT_12; // Dmax=4095
static const adc1_channel_t adc_chan = ADC1_CHANNEL_6;      // Pin 34
#endif

static void adc_initialize() {
#ifdef CONFIG_ADC_INPUT
#if CONFIG_IDF_TARGET_ESP32
    if (esp_adc_cal_check_efuse(ESP_ADC_CAL_VAL_EFUSE_VREF)) {
        ESP_LOGI(TAG, "ADC: eFuse VRef not supported");
    } else {
        ESP_LOGD(TAG, "ADC: eFuse VRef supported");
    }
#endif // CONFIG_IDF_TARGET_ESP32
#if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2
    if (esp_adc_cal_check_efuse(ESP_ADC_CAL_VAL_EFUSE_TP)) {
        ESP_LOGI(TAG, "ADC: eFuse Two Point not supported");
    } else {
        ESP_LOGD(TAG, "ADC: eFuse Two Point supported");
    }
#else
    ESP_LOGE(TAG, "ADC: Unknown ESP chip target");
    return;
#endif // CONFIG_IDF_TARGET_ESP32
    adc1_config_width(adc_width);
    adc1_config_channel_atten(adc_chan, adc_atten);
    memset(&adc_chars, 0, sizeof(adc_chars));
    esp_adc_cal_value_t vtype = esp_adc_cal_characterize(
        adc_unit, adc_atten, adc_width, 1100, &adc_chars);
    if (vtype == ESP_ADC_CAL_VAL_EFUSE_TP) {
        ESP_LOGI(TAG, "ADC: characterized using Two Point Value");
    } else if (vtype == ESP_ADC_CAL_VAL_EFUSE_VREF) {
        ESP_LOGI(TAG, "ADC: characterized using eFuse VRef");
    } else {
        ESP_LOGI(TAG, "ADC: characterized using Default VRef");
    }
#endif // CONFIG_ADC_INPUT
}

uint32_t adc_read() {
#ifndef CONFIG_ADC_INPUT
    return 0;
#elif defined(ADC_MULTISAMPLING)
    uint32_t raw;
    LOOPN(i, ADC_MULTISAMPLING) {
        raw += adc1_get_raw(adc_chan);
    }
    raw /= ADC_MULTISAMPLING;
    return esp_adc_cal_raw_to_voltage(raw, &adc_chars);
#else
    return esp_adc_cal_raw_to_voltage(adc1_get_raw(adc_chan), &adc_chars);
#endif
}


// PWM for Servo

// mapping 0-180 deg to 0.5-2.5 ms by 10bit resolution
#ifdef CONFIG_PWM_SERVO
static float duty_offset = 0.5 / 20 * ((1 << 10) - 1);
static float duty_scale  = 2.0 / 20 * ((1 << 10) - 1) / 180;

static void pwm_initialize() {
    ledc_timer_config_t timer_conf = {
        .speed_mode         = LEDC_LOW_SPEED_MODE,
        .timer_num          = LEDC_TIMER_1,
        .duty_resolution    = LEDC_TIMER_10_BIT,
        .freq_hz            = 50, // 20ms
        .clk_cfg            = LEDC_AUTO_CLK
    };
    ESP_ERROR_CHECK(ledc_timer_config(&timer_conf));
    ledc_channel_config_t channel0_conf = {
        .gpio_num           = PIN_SVOH,
        .speed_mode         = LEDC_LOW_SPEED_MODE,
        .channel            = LEDC_CHANNEL_1,
        .timer_sel          = LEDC_TIMER_1,
        .hpoint             = 0,
        .duty               = 0
    };
    ledc_channel_config_t channel1_conf = {
        .gpio_num           = PIN_SVOV,
        .speed_mode         = LEDC_LOW_SPEED_MODE,
        .channel            = LEDC_CHANNEL_2,
        .timer_sel          = LEDC_TIMER_1,
        .hpoint             = 0,
        .duty               = 0
    };
    ESP_ERROR_CHECK(ledc_channel_config(&channel0_conf));
    ESP_ERROR_CHECK(ledc_channel_config(&channel1_conf));
}

static esp_err_t pwm_duty(ledc_channel_t channel, int degree) {
    int duty = degree * duty_scale + duty_offset;
    esp_err_t err = ledc_set_duty(LEDC_LOW_SPEED_MODE, channel, duty);
    if (!err) err = ledc_update_duty(LEDC_LOW_SPEED_MODE, channel);
    return err;
}

esp_err_t pwm_degree(int hdeg, int vdeg) {
    esp_err_t err = ESP_OK;
    if (hdeg >= 0) {
        hdeg = 166 * hdeg / 180 + 14; // map virtual 0-180 to real 14-180
        if (( err = pwm_duty(LEDC_CHANNEL_1, MAX(14, MIN(hdeg, 180))) ))
            return err;
    }
    if (vdeg >= 0) {
        if (( err = pwm_duty(LEDC_CHANNEL_2, MAX(0, MIN(vdeg, 160))) ))
            return err;
    }
    return err;
}

#else

static void pwm_initialize() { ; }
esp_err_t pwm_degree(int hdeg, int vdeg) { return ESP_ERR_NOT_FOUND; }

#endif // CONFIG_PWM_SERVO

// I2C GPIO Expander

static esp_err_t i2c_master_config(int bus, int sda, int scl, int speed) {
    i2c_config_t master_conf = {
        .mode = I2C_MODE_MASTER,
        .sda_io_num = sda,
        .sda_pullup_en = GPIO_PULLUP_ENABLE,
        .scl_io_num = scl,
        .scl_pullup_en = GPIO_PULLUP_ENABLE
    };
    master_conf.master.clk_speed = speed;
    return i2c_param_config(bus, &master_conf);
}

static void i2c_initialize() {
    ESP_ERROR_CHECK( i2c_driver_install(NUM_I2C, I2C_MODE_MASTER, 0, 0, 0) );
    ESP_ERROR_CHECK( i2c_master_config(NUM_I2C, PIN_SDA0, PIN_SCL0, 50000) );
}

esp_err_t smbus_probe(int bus, uint8_t addr) {
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (addr << 1) | I2C_MASTER_WRITE, true);
    i2c_master_stop(cmd);
    esp_err_t err = i2c_master_cmd_begin(bus, cmd, pdMS_TO_TICKS(50));
    i2c_cmd_link_delete(cmd);
    return err;
}

esp_err_t smbus_wregs(int bus, uint8_t addr, uint8_t reg, uint8_t * val, size_t len) {
    // SMBus Write protocol:
    //      S | (ADDR | W) | ACK | REG | ACK | (DATA | ACK) * n | P
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, addr << 1 | I2C_MASTER_WRITE, true);
    i2c_master_write_byte(cmd, reg, true);
    i2c_master_write(cmd, val, len, true);
    i2c_master_stop(cmd);
    esp_err_t err = i2c_master_cmd_begin(bus, cmd, pdMS_TO_TICKS(50));
    i2c_cmd_link_delete(cmd);
    return err;
}

esp_err_t smbus_rregs(int bus, uint8_t addr, uint8_t reg, uint8_t *val, size_t len) {
    // SMBus Read protocol:
    //      S | (ADDR | W) | ACK | REG | ACK |
    //      S | (ADDR | R) | ACK | (DATA | A) * n - 1 | (DATA | N) | P
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, addr << 1 | I2C_MASTER_WRITE, true);
    i2c_master_write_byte(cmd, reg, true);
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, addr << 1 | I2C_MASTER_READ, true);
    if (len > 1)
        i2c_master_read(cmd, val, len - 1, I2C_MASTER_ACK);
    i2c_master_read_byte(cmd, val + len - 1, I2C_MASTER_NACK);
    i2c_master_stop(cmd);
    esp_err_t err = i2c_master_cmd_begin(bus, cmd, pdMS_TO_TICKS(50));
    i2c_cmd_link_delete(cmd);
    return err;
}

esp_err_t smbus_write_byte(int bus, uint8_t addr, uint8_t reg, uint8_t val) {
    return smbus_wregs(bus, addr, reg, &val, 1);
}

