hankso/esp32/espbase/main/drivers.c
esp_err_t smbus_read_byte(int bus, uint8_t addr, uint8_t reg, uint8_t *val) {
    return smbus_rregs(bus, addr, reg, val, 1);
}

esp_err_t smbus_write_word(int bus, uint8_t addr, uint8_t reg, uint16_t val) {
    uint8_t buf[2] = { val >> 8, val & 0xFF };
    return smbus_wregs(bus, addr, reg, buf, 2);
}

esp_err_t smbus_read_word(int bus, uint8_t addr, uint8_t reg, uint16_t *val) {
    uint8_t buf[2] = { 0, 0 };
    esp_err_t err = smbus_rregs(bus, addr, reg, buf, 2);
    if (!err) *val = buf[0] << 8 | buf[1];
    return err; // FIXME: check_endian and skip this tedious conversion
}

esp_err_t smbus_dump(int bus, uint8_t addr, uint8_t start, uint8_t end) {
    int length = 16;
    size_t len = end - start;
    uint8_t *buf = (uint8_t *)malloc(len);
    if (!buf) return ESP_ERR_NO_MEM;
    esp_err_t err = smbus_rregs(bus, addr, start, buf, len);
    if (err) return err;
    for (uint8_t reg = start; reg <= end; reg++) {
        if (reg == start) {
            printf("I2C %d-%02X register table\n", bus, addr);
            printf("ADDR:");
            LOOPN(i, length) {
                printf(" %02X", i);
            }
            printf("\n%04X:%*s", reg - (reg % length), 3 * (reg % length), "");
        } else if (reg % length == 0) {
            printf("\n%04X:", reg);
        }
        printf(" %02X", buf[reg - start]);
    }
    putchar('\n');
    return err;
}

void i2c_detect(int bus) {
    LOOPN(i, 0x10) {
        if (!i) printf("  ");
        printf(" %02X", i);
    }
    LOOPN(addr, 0x7F) {
        if (addr % 0x10 == 0)
            printf("\n%02X", addr);
        if (!addr) {
            printf("   ");
            continue;
        }
        switch (smbus_probe(bus, addr)) {
        case ESP_OK:
            printf(" %02X", addr); break;
        case ESP_ERR_TIMEOUT:
            printf(" UU"); break;
        default:
            printf(" --");
        }
    }
}

static esp_err_t UNUSED i2c_trans(int bus, uint8_t addr,
                                        uint8_t rw, uint8_t *data, size_t size)
{
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (addr << 1) | rw, true);
    if (rw == I2C_MASTER_WRITE) {
        if (size > 1) {
            i2c_master_write(cmd, data, size, true);
        } else {
            i2c_master_write_byte(cmd, *data, true);
        }
    } else if (rw == I2C_MASTER_READ) {
        if (size > 1) {
            i2c_master_read(cmd, data, size - 1, I2C_MASTER_ACK);
            i2c_master_read_byte(cmd, data + size - 1, I2C_MASTER_LAST_NACK);
        } else {
            i2c_master_read_byte(cmd, data, I2C_MASTER_NACK);
        }
    }
    i2c_master_stop(cmd);
    esp_err_t err = i2c_master_cmd_begin(bus, cmd, pdMS_TO_TICKS(50));
    i2c_cmd_link_delete(cmd);
    return err;
}

#ifdef CONFIG_I2C_GPIOEXP
static uint8_t i2c_pin_data[3] = { 0, 0, 0 };
static uint8_t i2c_pin_addr[3] = { 0b0100000, 0b0100001, 0b0100010 };
#endif

esp_err_t i2c_gpio_set_level(i2c_pin_num_t pin_num, bool level) {
#ifdef CONFIG_I2C_GPIOEXP
    if (!PIN_IS_I2CEXP(pin_num)) return ESP_ERR_INVALID_ARG;
    int pin = pin_num - PIN_I2C_MIN;
    uint8_t idx = pin >> 3, mask = BIT(pin & 0x7), *datp = i2c_pin_data + idx;
    *datp = level ? (*datp | mask) : (*datp & ~mask);
    return i2c_trans(NUM_I2C, i2c_pin_addr[idx], I2C_MASTER_WRITE, datp, 1);
#else
    return ESP_ERR_NOT_FOUND;
#endif // CONFIG_I2C_GPIOEXP
}

esp_err_t i2c_gpio_get_level(i2c_pin_num_t pin_num, bool * level, bool sync) {
#ifdef CONFIG_I2C_GPIOEXP
    esp_err_t err = ESP_ERR_INVALID_ARG;
    if (!PIN_IS_I2CEXP(pin_num)) return err;
    int pin = pin_num - PIN_I2C_MIN;
    uint8_t idx = pin >> 3, mask = BIT(pin & 0x7), *datp = i2c_pin_data + idx;
    if (sync)
        err = i2c_trans(NUM_I2C, i2c_pin_addr[idx], I2C_MASTER_READ, datp, 1);
    if (!err)
        *level = *datp & mask;
    return err;
#else
    return ESP_ERR_NOT_FOUND;
#endif // CONFIG_I2C_GPIOEXP
}


// I2C Distance Measurement


#ifdef WITH_VLX
static vl53l0x_t *vlx;
#endif

static void vlx_initialize() {
    uint8_t addr = 0x29;
    if (smbus_probe(NUM_I2C, addr)) return;
#ifdef WITH_VLX
    vlx = vl53l0x_config(NUM_I2C, PIN_SCL0, PIN_SDA0, -1, addr, 0);
    const char *err = vl53l0x_init(vlx);
    if (err) {
        ESP_LOGE(TAG, "VLX: initialize VL53L0X failed: %s", err);
        vl53l0x_end(vlx);
        vlx = NULL;
    }
#else
    ESP_LOGE(TAG, "VLX: sensor is not supported");
#endif // WITH_VLX
}

uint16_t vlx_probe() {
#ifdef WITH_VLX
    TickType_t tick_start = xTaskGetTickCount();
    uint16_t result_mm = vl53l0x_readRangeSingleMillimeters(vlx);
    int took_ms = ((int)xTaskGetTickCount() - tick_start) * portTICK_PERIOD_MS;
    if (result_mm != (uint16_t)-1) {
        printf("VLX: range %u mm took %d ms", result_mm, took_ms);
    } else {
        printf("VLX: failed to measure range");
    }
    return result_mm;
#else
    return 0;
#endif // WITH_VLX
}


// I2C OLED Screen


#ifdef WITH_U8G2

static u8g2_t scn;
static bool scn_init = false;

static void scn_initialize() {
    // MACROs defined in u8g2_esp32_hal.h
    int bus = I2C_MASTER_NUM, speed = I2C_MASTER_FREQ_HZ, addr = 0x3C;
    if (i2c_driver_install(bus, I2C_MODE_MASTER, 0, 0, 0)) return;
    scn_init = i2c_master_config(bus, PIN_SDA1, PIN_SCL1, speed) == ESP_OK;
    scn_init = scn_init && smbus_probe(bus, addr) == ESP_OK;
    if (!scn_init) return;
    i2c_driver_delete(bus);

    u8g2_esp32_hal_t u8g2_esp32_hal = U8G2_ESP32_HAL_DEFAULT;
    u8g2_esp32_hal.sda = PIN_SDA1;
    u8g2_esp32_hal.scl = PIN_SCL1;
    u8g2_esp32_hal_init(u8g2_esp32_hal);
    u8g2_Setup_ssd1306_i2c_128x64_noname_f(
        &scn, U8G2_R0,
        u8g2_esp32_i2c_byte_cb,
        u8g2_esp32_gpio_and_delay_cb);
    u8x8_SetI2CAddress(&scn.u8x8, addr << 1);
    u8g2_SetFont(&scn, u8g2_font_ncenB08_tr);
    u8g2_InitDisplay(&scn);
    u8g2_SetPowerSave(&scn, 0);
}

void scn_progbar(uint8_t percent) {
    if (!scn_init) return;
    static char buf[16];
    snprintf(buf, sizeof(buf), "%d %%", percent);
    u8g2_ClearBuffer(&scn);
    u8g2_DrawFrame(&scn, 0, 20, 128, 6);
    u8g2_DrawBox(&scn, 0, 20, 128 * percent / 100, 6);
    u8g2_DrawStr(&scn, (128 - u8g2_GetStrWidth(&scn, buf)) / 2, 28 + 8, buf);
    u8g2_SendBuffer(&scn);
}

#else

static void scn_initialize() { ESP_LOGE(TAG, "Screen is not supported"); }
void scn_progbar(uint8_t percent) { ; }

#endif // WITH_U8G2


// I2C Ambient Light and Temperature Sensor
// 7bit I2C address of the GY39 is 0x5B.

esp_err_t gy39_measure(int bus, gy39_data_t *d) {
    esp_err_t err;
    uint8_t a[0x0D];
    if (( err = smbus_rregs(bus, 0x5B, 0x00, a, sizeof(a)) )) return err;
    d->brightness = 1e-2 * ((a[0] << 24) | (a[1] << 16) | (a[2] << 8) | a[3]);
    d->temperature = 1e-2 * ((a[4] << 8) | a[5]);
    d->atmosphere = 1e-2 * ((a[6] << 24) | (a[7] << 16) | (a[8] << 8) | a[9]);
    d->humidity = 1e-2 * ((a[10] << 8) | a[11]);
    d->altitude = (a[12] << 8) | a[13];
    return err;
}

// I2C Ambient Light Sensor
// 7bit I2C address of the OPT3001 is configurable by ADDR PIN.
// Basic address is 0b010001XX where `XX` are:
//      ADDR -> GND: 0b00
//      ADDR -> VDD: 0b01
//      ADDR -> SDA: 0b10
//      ADDR -> SCL: 0b11

#ifdef CONFIG_ALS_TRACK
static uint8_t i2c_als_addr[4] = {
    0b01000100, 0b01000101,         // east, west
    0b01000110, 0b01000111          // south, north
};
#endif

static void als_initialize() {
#ifdef CONFIG_ALS_TRACK
    esp_err_t err;
    uint8_t addr;
    uint16_t buf[2];
    LOOPN(i, 4) {
        if (smbus_probe(NUM_I2C, addr = i2c_als_addr[i]))
            continue;
        if (
            ( err = smbus_read_word(NUM_I2C, addr, 0x7E, buf + 0) ) ||
            ( err = smbus_read_word(NUM_I2C, addr, 0x7F, buf + 1) )
        ) {
            ESP_LOGE(TAG, "ALS: read %d failed: %s", i, esp_err_to_name(err));
            continue;
        }
        ESP_LOGI(TAG, "ALS: found %c%c %04X at I2C %d-%02X",
                buf[0] >> 8, buf[0] & 0xFF, buf[1], NUM_I2C, addr);
        smbus_write_word(NUM_I2C, addr, 0x01, 0xC610); // continuous mode
        // TODO: configure Low-Limit and Hight-Limit and Interrupt GPIO
    }
#endif // CONFIG_ALS_TRACK
}

float als_brightness(int idx) {
#ifdef CONFIG_ALS_TRACK
    if (idx < 0 || idx > 3) {
        ESP_LOGE(TAG, "ALS: invalid chip index %d", idx);
        return 0;
    }
    uint16_t val;
    esp_err_t err;
    if (( err = smbus_read_word(NUM_I2C, i2c_als_addr[idx], 0x00, &val) )) {
        ESP_LOGW(TAG, "ALS: read %d failed: %s", idx, esp_err_to_name(err));
        return 0;
    }
    // Equation 3 at Page 20 of OPT3001 datasheet:
    //   lux = 0.01 * 2^E[3:0] * R[11:0]
    return 0.01 * (1 << (val >> 12)) * (val & 0xFFF);
#else
    return 0;
#endif // CONFIG_ALS_TRACK
}

