hankso/esp32/espbase/main/drivers.c
esp_err_t als_tracking(als_track_t idx, int *hdeg, int *vdeg) {
#ifdef CONFIG_ALS_TRACK
    esp_err_t err;
    float bmax = 0, bmin = 1e10, btmp[4];
    switch (idx) {
    case ALS_TRACK_0: case ALS_TRACK_1:     // maximize brightness
    case ALS_TRACK_2: case ALS_TRACK_3:
        for (int i = 0, v = 0; v < 90; i++, v += 6) {
            for (int h = 0; h < 180; h += 5) {
                int htmp = i % 2 ? (180 - h) : h; // S line scanning
                if (( err = pwm_degree(htmp, v) )) return err;
                msleep(50);
                btmp[0] = als_brightness(idx);
                ESP_LOGD(TAG, "ALS: H %3d V %3d %8.2f lux\n", htmp, v, btmp[0]);
                if (btmp[0] > bmax) {
                    bmax = btmp[0];
                    *hdeg = htmp;
                    *vdeg = v;
                }
            }
        }
        break;
    case ALS_TRACK_H:           // minimize difference of east and west
        for (int h = 0; h < 180; h += 15) {
            if (( err = pwm_degree(h, -1) )) return err;
            msleep(200);
            if (( btmp[0] = als_brightness(0) ) > bmax) bmax = btmp[0];
            if (( btmp[1] = als_brightness(1) ) > bmax) bmax = btmp[1];
            if (( btmp[2] = ABSDIFF(btmp[0], btmp[1]) ) < bmin) {
                bmin = btmp[2];
                *hdeg = h;
            }
        }
        break;
    case ALS_TRACK_V:           // minimize difference of north and south
        for (int v = 0; v < 90; v += 9) {
            if (( err = pwm_degree(-1, v) )) return err;
            msleep(200);
            if (( btmp[0] = als_brightness(2) ) > bmax) bmax = btmp[0];
            if (( btmp[1] = als_brightness(3) ) > bmax) bmax = btmp[1];
            if (( btmp[2] = ABSDIFF(btmp[0], btmp[1]) ) < bmin) {
                bmin = btmp[2];
                *vdeg = v;
            }
        }
        break;
    case ALS_TRACK_A:
        puts("TODO: PID Light Tracking"); break;
    default: return ESP_ERR_INVALID_ARG;
    }
    if (bmax != 0 || bmin != 1e10) {
        return pwm_degree(*hdeg, *vdeg);
    }
#endif // CONFIG_ALS_TRACK
    return ESP_ERR_NOT_FOUND;
}

// SPI GPIO Expander
// If transmitted data is 32bits or less, spi_transaction_t can use tx_data.
// Here we have no more than 4 chips, thus SPI_TRANS_USE_TXDATA.
#ifdef CONFIG_SPI_GPIOEXP
static spi_device_handle_t spi_pin_hdlr;
static spi_transaction_t spi_pin_trans;
static uint8_t spi_pin_data[2] = { 0, 0 };
#endif

static void spi_initialize() {
#ifdef CONFIG_SPI_GPIOEXP
    spi_bus_config_t hspi_busconf = {
        .mosi_io_num = PIN_HMOSI,
        .miso_io_num = PIN_HMISO,
        .sclk_io_num = PIN_HSCLK,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = 0,
        .flags = SPICOMMON_BUSFLAG_MASTER,
        .intr_flags = 0
    };
    spi_device_interface_config_t devconf = {
        .command_bits = 0,
        .address_bits = 0,
        .dummy_bits = 0,
        .mode = 0b10,                       // CPOL = 1, CPHA = 0
        .duty_cycle_pos = 128,              // 128/255 = 50% (Tlow = Thigh)
        .cs_ena_pretrans = 0,
        .cs_ena_posttrans = 0,
        .clock_speed_hz = 5 * 1000 * 1000,  // 5MHz
        .input_delay_ns = 0,
        .spics_io_num = PIN_HCS1,
        .flags = 0,
        .queue_size = 1,                    // only one transaction allowed
        .pre_cb = NULL,
        .post_cb = NULL
    };
    esp_err_t err = spi_bus_initialize(HSPI_HOST, &hspi_busconf, 1);
    assert((!err || err == ESP_ERR_INVALID_STATE) && "SPI init failed");
    ESP_ERROR_CHECK( spi_bus_add_device(HSPI_HOST, &devconf, &spi_pin_hdlr) );
    spi_pin_trans.length = LEN(spi_pin_data) * 8; // in bits;
    spi_pin_trans.tx_buffer = spi_pin_data;
#endif // CONFIG_SPI_GPIOEXP
}

esp_err_t spi_gpio_set_level(spi_pin_num_t pin_num, bool level) {
#ifdef CONFIG_SPI_GPIOEXP
    if (!PIN_IS_SPIEXP(pin_num)) return ESP_ERR_INVALID_ARG;
    int pin = pin_num - PIN_SPI_MIN;
    uint8_t idx = pin >> 3, mask = BIT(pin & 0x7), *datp = spi_pin_data + idx;
    *datp = level ? (*datp | mask) : (*datp & ~mask);
    return spi_device_polling_transmit(spi_pin_hdlr, &spi_pin_trans);
#else
    return ESP_ERR_NOT_FOUND;
#endif // CONFIG_SPI_GPIOEXP
}

esp_err_t spi_gpio_get_level(spi_pin_num_t pin_num, bool * level, bool sync) {
#ifdef CONFIG_SPI_GPIOEXP
    esp_err_t err = ESP_ERR_INVALID_ARG;
    if (!PIN_IS_SPIEXP(pin_num)) return err;
    int pin = pin_num - PIN_SPI_MIN;
    uint8_t idx = pin >> 3, mask = BIT(pin & 0x7);
    if (sync)
        err = spi_device_polling_transmit(spi_pin_hdlr, &spi_pin_trans);
    if (!err)
        *level = spi_pin_data[idx] & mask;
    return err;
#else
    return ESP_ERR_NOT_FOUND;
#endif // CONFIG_SPI_GPIOEXP
}

// GPIO Interrupt

static button_handle_t btn;
#ifdef CONFIG_KNOB_INPUT
static knob_handle_t knob;
#endif

static void gpio_cb_single_click(void *arg, void *data) {
    ESP_LOGI(TAG, "BTN: %d single click", PIN_BTN);
}

static void gpio_cb_double_click(void *arg, void *data) {
    ESP_LOGI(TAG, "BTN: %d double click", PIN_BTN);
}

static void gpio_cb_long_press(void *arg, void *data) {
    ESP_LOGI(TAG, "BTN: %d long press", PIN_BTN);
}

static void UNUSED gpio_cb_left_rotate(void *arg, void *data) {
    ESP_LOGI(TAG, "Knob: left rotate %d",
            iot_knob_get_count_value((button_handle_t)arg));
}

static void UNUSED gpio_cb_right_rotate(void *arg, void *data) {
    ESP_LOGI(TAG, "Knob: right rotate %d",
            iot_knob_get_count_value((button_handle_t)arg));
}

static void IRAM_ATTR UNUSED gpio_isr_endstop(void *arg) {
    // static char buf[9];
    ets_printf("PIN_BTN %s\n", gpio_get_level(PIN_BTN) ? "RISE" : "FALL");
#ifdef CONFIG_I2C_GPIOEXP
    LOOPN(i, LEN(i2c_pin_data)) {
        i2c_trans(NUM_I2C, i2c_pin_addr[i], I2C_MASTER_READ, i2c_pin_data + i, 1);
        // itoa(i2c_pin_data[idx], buf, 2);
        // ESP_LOGI(TAG, "I2C GPIO Expander value: 0b%s", buf);
    }
#endif // CONFIG_I2C_GPIOEXP
#ifdef CONFIG_SPI_GPIOEXP
    if (!spi_device_polling_transmit(spi_pin_hdlr, &spi_pin_trans)) {
        // ESP_LOGI(TAG, "SPI GPIO Expander value: 0b%s", buf);
    }
#endif // CONFIG_SPI_GPIOEXP
}

static void gpio_initialize() {
#if defined(CONFIG_I2C_GPIOEXP) || defined(CONFIG_SPI_GPIOEXP)
    gpio_config_t int_conf = {
        .pin_bit_mask = BIT64(PIN_INT),
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_NEGEDGE
    };
    ESP_ERROR_CHECK( gpio_config(&int_conf) );
    ESP_ERROR_CHECK( gpio_install_isr_service(0) );
    ESP_ERROR_CHECK( gpio_isr_handler_add(PIN_INT, gpio_isr_endstop, NULL) );
#endif
#ifdef CONFIG_KNOB_INPUT
    knob_cb_t knob_funcs[] = { gpio_cb_left_rotate, gpio_cb_right_rotate };
    knob_event_t knob_evts[] = { KNOB_LEFT, KNOB_RIGHT };
    knob_config_t knob_conf = {
        .default_direction = 0,     // 0:positive; 1:negative
        .gpio_encoder_a = PIN_ENCA,
        .gpio_encoder_b = PIN_ENCB
    };
    if (!( knob = iot_knob_create(&knob_conf) )) {
        ESP_LOGE(TAG, "Knob: bind to GPIO%d & %d failed", PIN_ENCA, PIN_ENCB);
    } else LOOPN(i, LEN(knob_evts)) {
        iot_knob_register_cb(knob, knob_evts[i], knob_funcs[i], NULL);
    }
#endif
    button_cb_t btn_funcs[] = {
        gpio_cb_single_click, gpio_cb_double_click, gpio_cb_long_press
    };
    button_event_t btn_evts[] = {
        BUTTON_SINGLE_CLICK, BUTTON_DOUBLE_CLICK, BUTTON_LONG_PRESS_START
    };
    button_config_t btn_conf = {
        .type = BUTTON_TYPE_GPIO,
        .gpio_button_config = {
            .gpio_num = PIN_BTN,
            .active_level = 1,
        }
    };
    if (!( btn = iot_button_create(&btn_conf) )) {
        ESP_LOGE(TAG, "BTN: bind to GPIO%d failed", PIN_BTN);
    } else LOOPN(i, LEN(btn_evts)) {
        iot_button_register_cb(btn, btn_evts[i], btn_funcs[i], NULL);
    }
}

esp_err_t gpioext_set_level(int pin, bool level) {
    if (GPIO_IS_VALID_GPIO(pin))    return gpio_set_level(pin, level);
    if (PIN_IS_I2CEXP(pin))         return i2c_gpio_set_level(pin, level);
    if (PIN_IS_SPIEXP(pin))         return spi_gpio_set_level(pin, level);
    return ESP_ERR_INVALID_ARG;
}

esp_err_t gpioext_get_level(int pin, bool * level, bool sync) {
    if (GPIO_IS_VALID_GPIO(pin)) {
        *level = gpio_get_level(pin);
        return ESP_OK;
    }
    if (PIN_IS_I2CEXP(pin)) return i2c_gpio_get_level(pin, level, sync);
    if (PIN_IS_SPIEXP(pin)) return spi_gpio_get_level(pin, level, sync);
    return ESP_ERR_INVALID_ARG;
}

static const char * const gpio_default_usage[GPIO_PIN_COUNT] = {
    [0]         = "Strapping",
    [1]         = "UART TXD",
    [2]         = "Strapping",
    [3]         = "UART RXD",
    [34]        = "ADC1 Channel6",

    [PIN_LED]   = "LED",
    [PIN_BTN]   = "Button",
#if defined(CONFIG_I2C_GPIOEXP) || defined(CONFIG_SPI_GPIOEXP)
    [PIN_INT]   = "Interrupt",
#endif

    [PIN_SDA0]  = "I2C0 SDA",
    [PIN_SCL0]  = "I2C0 SCL",
    [PIN_SDA1]  = "I2C1 SDA",
    [PIN_SCL1]  = "I2C1 SCL",

    [PIN_HMISO] = "HSPI MISO",
    [PIN_HMOSI] = "HSPI MOSI",
    [PIN_HSCLK] = "HSPI SCLK",
    [PIN_HCS0]  = "HSPI CS0 (SDCard)",
#ifdef CONFIG_SPI_GPIOEXP
    [PIN_HCS1]  = "HSPI CS1 (GPIOExp)",
#endif

#ifdef CONFIG_PWM_SERVO
    [PIN_SVOH]  = "Servo Yaw",
    [PIN_SVOV]  = "Servo Pitch",
#endif
#ifdef CONFIG_KNOB_INPUT
    [PIN_ENCA]  = "Knob encoder A",
    [PIN_ENCB]  = "Knob encoder B",
#endif
};

void gpio_table(bool i2c, bool spi) {
    bool level;
    esp_err_t err;
    const char * value;
    for (gpio_num_t pin = 0; pin < GPIO_PIN_COUNT; pin++) {
        if (!pin)
            printf("Native GPIO %d-%d\nPIN Value Usage\n", 0, GPIO_PIN_COUNT - 1);
        if (!GPIO_IS_VALID_GPIO(pin))
            continue;
        value = gpio_get_level(pin) ? "HIGH" : "LOW";
        printf("%-3d %5s %s\n", pin, value, gpio_default_usage[pin] ?: "");
    }
    for (i2c_pin_num_t pin = PIN_I2C_MIN; i2c && pin < PIN_I2C_MAX; pin++) {
        if (pin == PIN_I2C_MIN)
            printf("\nI2C GPIO EXP %d-%d\nPIN Value\n", PIN_I2C_MIN, PIN_I2C_MAX - 1);
        err = i2c_gpio_get_level(pin, &level, false);
        value = err ? esp_err_to_name(err) : (level ? "HIGH" : "LOW");
        printf("%-3d %5s\n", pin, value);
    }
    for (spi_pin_num_t pin = PIN_SPI_MIN; spi && pin < PIN_SPI_MAX; pin++) {
        if (pin == PIN_SPI_MIN)
            printf("\nSPI GPIO EXP %d-%d\nPIN Value\n", PIN_SPI_MIN, PIN_SPI_MAX - 1);
        err = spi_gpio_get_level(pin, &level, false);
        value = err ? esp_err_to_name(err) : (level ? "HIGH" : "LOW");
        printf("%-3d %5s\n", pin, value);
    }
}

// Others

