hankso/esp32/espbase/main/drivers.c
static void uart_initialize() {
    fflush(stdout); fflush(stderr);
    msleep(10);

    // UART driver configuration
    uart_config_t uart_conf = {
        .baud_rate = 115200,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .rx_flow_ctrl_thresh = 0,
        .use_ref_tick = true
    };
    ESP_ERROR_CHECK( uart_param_config(NUM_UART, &uart_conf) );
    ESP_ERROR_CHECK( uart_driver_install(NUM_UART, 256, 0, 0, NULL, 0) );

    // Register UART to VFS and configure
    /* esp_vfs_dev_uart_register(); */
    esp_vfs_dev_uart_use_driver(NUM_UART);
    esp_vfs_dev_uart_port_set_rx_line_endings(NUM_UART, ESP_LINE_ENDINGS_CR);
    esp_vfs_dev_uart_port_set_tx_line_endings(NUM_UART, ESP_LINE_ENDINGS_CRLF);
}

static void twdt_initialize() {
#ifdef CONFIG_TASK_WDT
    ESP_ERROR_CHECK(esp_task_wdt_init(5, false));

    // Idle tasks are created on each core automatically by RTOS scheduler
    // with the lowest possible priority (0). Our tasks have higher priority,
    // thus leaving almost no time for idle tasks to run. Disable WDT on them.
    #ifdef CONFIG_FREERTOS_UNICORE
    LOOPN(i, 1)
    #else
    LOOPN(i, 2)
    #endif // CONFIG_FREERTOS_UNICORE
    {
        TaskHandle_t idle = xTaskGetIdleTaskHandleForCPU(i);
        if (idle && !esp_task_wdt_status(idle) && !esp_task_wdt_delete(idle)) {
            ESP_LOGW(TAG, "Task IDLE%d @ CPU%d removed from WDT", i, i);
        }
    }
#endif // CONFIG_TASK_WDT
}

esp_err_t twdt_feed() {
#ifdef CONFIG_TASK_WDT
    return esp_task_wdt_reset();
#endif // CONFIG_TASK_WDT
    return ESP_OK;
}

void driver_initialize() {
    pwm_initialize();
    adc_initialize();
    led_initialize();

    i2c_initialize();
    vlx_initialize();
    als_initialize();
    scn_initialize();

    spi_initialize();
    gpio_initialize();
    uart_initialize();
    twdt_initialize();
}
